'use strict'; /*- объявляем что будем работать в новом режиме */

/* Функция для вывода четных и нечетных чисел */

/* function num(arg) {
    if (arg % 2 == 0) {
        alert('Четные');
    } else {
        alert('Не четные');
    }
    return num;
}

console.log(num(100)); */

//------------------------------------------------------------------------------------------------------------------------------------------------------------

//1.Напишите функцию max(a,b), которая возвращает наибольшее из чисел a и b.

/* function max(a, b) {
    if (a > b) {
        alert(a);
    } else {
        alert(b);
    }
}

max(44, 16); */

//------------------------------------------------------------------------------------------------------------------------------------------------------------

//2.Написать функцию, которая вычисляет среднее арифметическое элементов , переданных ей в качестве аргументов. Пусть будет передано 3 аргумента.

/* function sum (a, b, c) {
    let x = ((a + b + c) / 3);
    alert(x);

}

sum (4, 8, 4); */

//------------------------------------------------------------------------------------------------------------------------------------------------------------

//3.Напишите функцию pow(x,n), которая возвращает x в степени n. Иначе говоря, умножает x на себя n раз и возвращает результат.

/* function pow(x,n) {
    let summ = x ** n;
    alert(summ);
}

pow(2, 3); */

//------------------------------------------------------------------------------------------------------------------------------------------------------------

//1. Создайте функцию,
//которая принимает два числа в качестве аргументов (num, length) и возвращает массив, каждый элемент которого кратный num, пока длина массива не достигнет length.

/* arrayOfMultiples(7, 5) ➞ [7, 14, 21, 28, 35]

arrayOfMultiples(12, 10) ➞ [12, 24, 36, 48, 60, 72, 84, 96, 108, 120]

arrayOfMultiples(17, 6) ➞ [17, 34, 51, 68, 85, 102] */

//Обратите внимание, что num также включено в возвращаемый массив.

/*  function arrayOfMultiples(num, length) {
    var ar = [];
     for (var i = 0; i < length; i++) {
        ar.push(num * (ar.length +1));
     }
     return ar;
 }

 console.log(arrayOfMultiples(7, 5));
 console.log(arrayOfMultiples(12, 10));
 console.log(arrayOfMultiples(17, 6)); */

//------------------------------------------------------------------------------------------------------------------------------------------------------------

//2. Учитывая число(в виде аргумента), верните массив, содержащий две половины числа. Если число нечетное, сделайте крайнее правое число выше.

//Все числа должны быть целыми.
//Вы также можете ожидать отрицательные числа.

/* numberSplit(4) ➞ [2, 2]

numberSplit(10) ➞ [5, 5]

numberSplit(11) ➞ [5, 6]

numberSplit(-9) ➞ [-5, -4]
 */

/* function numberSplit(numb) {
    var ar = [];
    if (numb % 2 === 0) {
        ar.push(numb/2);
        ar.push(numb/2);
    } else {
        var firstOperand = (numb/2) - 0.5;
        var secondOperand = (numb/2) + 0.5;
        ar.push(firstOperand);
        ar.push(secondOperand);
    }
    return ar;
}

console.log(numberSplit(4));
console.log(numberSplit(10));
console.log(numberSplit(11));
console.log(numberSplit(-9)); */

//------------------------------------------------------------------------------------------------------------------------------------------------------------

//Task1. Напишите функцию, которая для каждого элемента массива добавлять +1 к текущему числу.

/* incrementElements([0, 1, 2, 3]) ➞ [1, 2, 3, 4]

incrementElements([2, 4, 6, 8]) ➞ [3, 5, 7, 9]

incrementElements([-1, -2, -3, -4]) ➞ [0, -1, -2, -3] */

/* function incrementElements(arr) {
    for (var i = 0; i < arr.length; i++) {
        arr[i]+=1;
    }
    return arr;
}

console.log(incrementElements([0, 1, 2, 3]));
console.log(incrementElements([2, 4, 6, 8]));
console.log(incrementElements([-1, -2, -3, -4])); */

//------------------------------------------------------------------------------------------------------------------------------------------------------------

// Task2. Напишите функцию для отображения массива в обратном порядке.

// reverse([1, 2, 3, 4]) ➞ [4, 3, 2, 1]

// reverse([9, 9, 2, 3, 4]) ➞ [4, 3, 2, 9, 9]

// reverse([]) ➞ []

/* function reverse(arr) {
    var arrResult = [];
    for(var i = arr.length -1; i >= 0; i--) {
        arrResult.push(arr[i]);
    }
    return arrResult;
}

console.log(reverse([1, 2, 3, 4]));
console.log(reverse([9, 9, 2, 3, 4]));
console.log(reverse([])); */

//------------------------------------------------------------------------------------------------------------------------------------------------------------

// Task3. Создайте функцию, которая принимает два массива и вставляет второй массив в середину первого массива.

// tuckIn([1, 10], [2, 3, 4, 5, 6, 7, 8, 9]) ➞ [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

// tuckIn([15,150], [45, 75, 35]) ➞ [15, 45, 75, 35, 150]

// tuckIn([[1, 2], [5, 6]], [[3, 4]]) ➞ [[1, 2], [3, 4], [5, 6]]

//* Первый массив всегда состоит из двух элементов.
/* 
function tuckIn (arr1, arr2) {
    var lastElement = arr1[1];
    arr1.pop();

    for(var i = 0; i < arr2.length; i++) {
        arr1.push(arr2[i]);
    }

    arr1.push(lastElement);

    return arr1;
}

console.log(tuckIn([1, 10], [2, 3, 4, 5, 6, 7, 8, 9]));
console.log(tuckIn([15,150], [45, 75, 35]));
console.log(tuckIn([[1, 2], [5, 6]], [[3, 4]])); */

 //------------------------------------------------------------------------------------------------------------------------------------------------------------
